hydra-benchmarks/plots/backups-plots/sandboxes-efficiency-v2/results/java/ph-hello-world-benchmark-8-1-2048/2/ab.log
This is ApacheBench, Version 2.3 <$Revision: 1879490 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking 172.18.0.2 (be patient)
Completed 204 requests
Completed 408 requests
Completed 612 requests
Completed 816 requests
Completed 1020 requests
Completed 1224 requests
Completed 1428 requests
Completed 1632 requests
Completed 1836 requests
Completed 2040 requests
Finished 2048 requests


Server Software:        
Server Hostname:        172.18.0.2
Server Port:            8080

Document Path:          /run
Document Length:        29 bytes

Concurrency Level:      8
Time taken for tests:   1.728 seconds
Complete requests:      2048
Failed requests:        0
Total transferred:      253952 bytes
Total body sent:        360448
HTML transferred:       59392 bytes
Requests per second:    1185.15 [#/sec] (mean)
Time per request:       6.750 [ms] (mean)
Time per request:       0.844 [ms] (mean, across all concurrent requests)
Transfer rate:          143.51 [Kbytes/sec] received
                        203.70 kb/s sent
                        347.21 kb/s total

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    0   0.4      0      16
Processing:     1    7   3.5      6      27
Waiting:        0    6   3.4      5      26
Total:          1    7   3.5      6      27

Percentage of the requests served within a certain time (ms)
  50%      6
  66%      7
  75%      8
  80%      8
  90%      9
  95%     16
  98%     19
  99%     19
 100%     27 (longest request)